app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'sahmirh@mail.com'
 LIMIT 1
---
            if (!$this->validate($rules, $errors)) {
                $data['validation'] = $this->validator;
            } else {
                $user = $this->usersM->where('email', $this->request->getVar('email'))
                    ->first();

SELECT *
FROM `users`
WHERE `id_users` = '5'
 LIMIT 1
---

        $data = [
            'title' => 'Profile',
            'user' => $model->where('id_users', session()->get('id_users'))->first()